; ModuleID = '/app/example.c'
source_filename = "/app/example.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._nj_ctx = type { i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, [3 x %struct._nj_cmp], i32, i32, [4 x [64 x i8]], [4 x [65536 x %struct._nj_code]], i32, i32, [64 x i32], i32, ptr }
%struct._nj_cmp = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct._nj_code = type { i8, i8 }

@nj = internal global %struct._nj_ctx zeroinitializer, align 8, !dbg !0
@njDecodeDHT.counts = internal unnamed_addr global [16 x i8] zeroinitializer, align 16, !dbg !24
@njZZ = internal unnamed_addr constant [64 x i8] c"\00\01\08\10\09\02\03\0A\11\18 \19\12\0B\04\05\0C\13\1A!(0)\22\1B\14\0D\06\07\0E\15\1C#*1892+$\1D\16\0F\17\1E%,3:;4-&\1F'.5<=6/7>?", align 16, !dbg !54

; Function Attrs: mustprogress nofree nosync nounwind willreturn memory(write, argmem: none, inaccessiblemem: none) uwtable
define dso_local void @njInit() local_unnamed_addr #0 !dbg !117 {
  tail call void @llvm.memset.p0.i64(ptr noundef nonnull align 8 dereferenceable(525032) @nj, i8 0, i64 525032, i1 false), !dbg !119
  ret void, !dbg !120
}

; Function Attrs: mustprogress nocallback nofree nounwind willreturn memory(argmem: write)
declare void @llvm.memset.p0.i64(ptr nocapture writeonly, i8, i64, i1 immarg) #1

; Function Attrs: nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nj", scope: !2, file: !6, line: 332, type: !61, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0 (https://github.com/llvm/llvm-project.git 08d094a0e457360ad8b94b017d2dc277e697ca76)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !23, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/app/example.c", directory: "/app")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_nj_result", file: !6, line: 117, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "example.c", directory: "/app")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "NJ_OK", value: 0)
!10 = !DIEnumerator(name: "NJ_NO_JPEG", value: 1)
!11 = !DIEnumerator(name: "NJ_UNSUPPORTED", value: 2)
!12 = !DIEnumerator(name: "NJ_OUT_OF_MEM", value: 3)
!13 = !DIEnumerator(name: "NJ_INTERNAL_ERR", value: 4)
!14 = !DIEnumerator(name: "NJ_SYNTAX_ERROR", value: 5)
!15 = !DIEnumerator(name: "__NJ_FINISHED", value: 6)
!16 = !{!17, !18, !21, !20, !22}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !{!0, !24, !54}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "counts", scope: !26, file: !6, line: 580, type: !51, isLocal: true, isDefinition: true)
!26 = distinct !DISubprogram(name: "njDecodeDHT", scope: !6, file: !6, line: 577, type: !27, scopeLine: 577, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !29)
!27 = !DISubroutineType(types: !28)
!28 = !{null}
!29 = !{!30, !31, !32, !33, !34, !35, !36, !43}
!30 = !DILocalVariable(name: "codelen", scope: !26, file: !6, line: 578, type: !22)
!31 = !DILocalVariable(name: "currcnt", scope: !26, file: !6, line: 578, type: !22)
!32 = !DILocalVariable(name: "remain", scope: !26, file: !6, line: 578, type: !22)
!33 = !DILocalVariable(name: "spread", scope: !26, file: !6, line: 578, type: !22)
!34 = !DILocalVariable(name: "i", scope: !26, file: !6, line: 578, type: !22)
!35 = !DILocalVariable(name: "j", scope: !26, file: !6, line: 578, type: !22)
!36 = !DILocalVariable(name: "vlc", scope: !26, file: !6, line: 579, type: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "nj_vlc_code_t", file: !6, line: 300, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nj_code", file: !6, line: 298, size: 16, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !39, file: !6, line: 299, baseType: !20, size: 8)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !39, file: !6, line: 299, baseType: !20, size: 8, offset: 8)
!43 = !DILocalVariable(name: "code", scope: !44, file: !6, line: 601, type: !20)
!44 = distinct !DILexicalBlock(scope: !45, file: !6, line: 600, column: 45)
!45 = distinct !DILexicalBlock(scope: !46, file: !6, line: 600, column: 13)
!46 = distinct !DILexicalBlock(scope: !47, file: !6, line: 600, column: 13)
!47 = distinct !DILexicalBlock(scope: !48, file: !6, line: 593, column: 55)
!48 = distinct !DILexicalBlock(scope: !49, file: !6, line: 593, column: 9)
!49 = distinct !DILexicalBlock(scope: !50, file: !6, line: 593, column: 9)
!50 = distinct !DILexicalBlock(scope: !26, file: !6, line: 583, column: 29)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 16)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "njZZ", scope: !2, file: !6, line: 334, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !59)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!60}
!60 = !DISubrange(count: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "nj_context_t", file: !6, line: 330, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nj_ctx", file: !6, line: 313, size: 4200256, elements: !63)
!63 = !{!64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !94, !95, !96, !100, !104, !105, !106, !108, !109}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !62, file: !6, line: 314, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "nj_result_t", file: !6, line: 125, baseType: !5)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !62, file: !6, line: 315, baseType: !18, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !6, line: 316, baseType: !22, size: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !62, file: !6, line: 317, baseType: !22, size: 32, offset: 160)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !62, file: !6, line: 318, baseType: !22, size: 32, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !62, file: !6, line: 318, baseType: !22, size: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mbwidth", scope: !62, file: !6, line: 319, baseType: !22, size: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mbheight", scope: !62, file: !6, line: 319, baseType: !22, size: 32, offset: 288)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mbsizex", scope: !62, file: !6, line: 320, baseType: !22, size: 32, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mbsizey", scope: !62, file: !6, line: 320, baseType: !22, size: 32, offset: 352)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ncomp", scope: !62, file: !6, line: 321, baseType: !22, size: 32, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !62, file: !6, line: 322, baseType: !77, size: 1152, offset: 448)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1152, elements: !92)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "nj_component_t", file: !6, line: 311, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nj_cmp", file: !6, line: 302, size: 384, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !79, file: !6, line: 303, baseType: !22, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ssx", scope: !79, file: !6, line: 304, baseType: !22, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ssy", scope: !79, file: !6, line: 304, baseType: !22, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !79, file: !6, line: 305, baseType: !22, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !79, file: !6, line: 305, baseType: !22, size: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !79, file: !6, line: 306, baseType: !22, size: 32, offset: 160)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "qtsel", scope: !79, file: !6, line: 307, baseType: !22, size: 32, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "actabsel", scope: !79, file: !6, line: 308, baseType: !22, size: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dctabsel", scope: !79, file: !6, line: 308, baseType: !22, size: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "dcpred", scope: !79, file: !6, line: 309, baseType: !22, size: 32, offset: 288)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !79, file: !6, line: 310, baseType: !21, size: 64, offset: 320)
!92 = !{!93}
!93 = !DISubrange(count: 3)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "qtused", scope: !62, file: !6, line: 323, baseType: !22, size: 32, offset: 1600)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "qtavail", scope: !62, file: !6, line: 323, baseType: !22, size: 32, offset: 1632)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "qtab", scope: !62, file: !6, line: 324, baseType: !97, size: 2048, offset: 1664)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !98)
!98 = !{!99, !60}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vlctab", scope: !62, file: !6, line: 325, baseType: !101, size: 4194304, offset: 3712)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 4194304, elements: !102)
!102 = !{!99, !103}
!103 = !DISubrange(count: 65536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !62, file: !6, line: 326, baseType: !22, size: 32, offset: 4198016)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bufbits", scope: !62, file: !6, line: 326, baseType: !22, size: 32, offset: 4198048)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !62, file: !6, line: 327, baseType: !107, size: 2048, offset: 4198080)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !59)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rstinterval", scope: !62, file: !6, line: 328, baseType: !22, size: 32, offset: 4200128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !62, file: !6, line: 329, baseType: !21, size: 64, offset: 4200192)
!110 = !{i32 7, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{i32 1, !"wchar_size", i32 4}
!113 = !{i32 8, !"PIC Level", i32 2}
!114 = !{i32 7, !"PIE Level", i32 2}
!115 = !{i32 7, !"uwtable", i32 2}
!116 = !{!"clang version 16.0.0 (https://github.com/llvm/llvm-project.git 08d094a0e457360ad8b94b017d2dc277e697ca76)"}
!117 = distinct !DISubprogram(name: "njInit", scope: !6, file: !6, line: 868, type: !27, scopeLine: 868, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !118)
!118 = !{}
!119 = !DILocation(line: 869, column: 5, scope: !117)
!120 = !DILocation(line: 870, column: 1, scope: !117)
!121 = distinct !DISubprogram(name: "njDone", scope: !6, file: !6, line: 872, type: !27, scopeLine: 872, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !122)
!122 = !{!123}
!123 = !DILocalVariable(name: "i", scope: !121, file: !6, line: 873, type: !22)
!124 = !DILocation(line: 0, scope: !121)
!125 = !DILocation(line: 875, column: 24, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !6, line: 875, column: 13)
!127 = distinct !DILexicalBlock(scope: !128, file: !6, line: 874, column: 5)
!128 = distinct !DILexicalBlock(scope: !121, file: !6, line: 874, column: 5)
!129 = !{!130, !134, i64 40}
!130 = !{!"_nj_cmp", !131, i64 0, !131, i64 4, !131, i64 8, !131, i64 12, !131, i64 16, !131, i64 20, !131, i64 24, !131, i64 28, !131, i64 32, !131, i64 36, !134, i64 40}
!131 = !{!"int", !132, i64 0}
!132 = !{!"omnipotent char", !133, i64 0}
!133 = !{!"Simple C/C++ TBAA"}
!134 = !{!"any pointer", !132, i64 0}
!135 = !DILocation(line: 875, column: 13, scope: !126)
!136 = !DILocation(line: 875, column: 13, scope: !127)
!137 = !DILocation(line: 875, column: 32, scope: !126)
!138 = !DILocation(line: 876, column: 12, scope: !139)
!139 = distinct !DILexicalBlock(scope: !121, file: !6, line: 876, column: 9)
!140 = !{!141, !134, i64 525024}
!141 = !{!"_nj_ctx", !132, i64 0, !134, i64 8, !131, i64 16, !131, i64 20, !131, i64 24, !131, i64 28, !131, i64 32, !131, i64 36, !131, i64 40, !131, i64 44, !131, i64 48, !132, i64 56, !131, i64 200, !131, i64 204, !132, i64 208, !132, i64 464, !131, i64 524752, !131, i64 524756, !132, i64 524760, !131, i64 525016, !134, i64 525024}
!142 = !DILocation(line: 876, column: 9, scope: !139)
!143 = !DILocation(line: 876, column: 9, scope: !121)
!144 = !DILocation(line: 876, column: 17, scope: !139)
!145 = !DILocation(line: 869, column: 5, scope: !117, inlinedAt: !146)
!146 = distinct !DILocation(line: 877, column: 5, scope: !121)
!147 = !DILocation(line: 878, column: 1, scope: !121)
!148 = !DISubprogram(name: "free", scope: !149, file: !149, line: 555, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !118)
!149 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !17}
!152 = distinct !DISubprogram(name: "njDecode", scope: !6, file: !6, line: 880, type: !153, scopeLine: 880, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !158)
!153 = !DISubroutineType(types: !154)
!154 = !{!65, !155, !157}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!158 = !{!159, !160}
!159 = !DILocalVariable(name: "jpeg", arg: 1, scope: !152, file: !6, line: 880, type: !155)
!160 = !DILocalVariable(name: "size", arg: 2, scope: !152, file: !6, line: 880, type: !157)
!161 = !DILocation(line: 0, scope: !152)
!162 = !DILocation(line: 0, scope: !121, inlinedAt: !163)
!163 = distinct !DILocation(line: 881, column: 5, scope: !152)
